#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/line-bot-sample2]
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/06e7b54e-fc23-4c2b-8939-aabde5bbb683]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.ecr-app.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-app]
module.rds.aws_key_pair.mmm2: Refreshing state... [id=mmm2]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-line-bot-sample2]
module.route53.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2021-04-27 09:08:01 +0000 UTC]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0b7249501f7f39f80]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0a31ed301afa10c9e]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0833e5cbb3feed7c4]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-03c288199d18a8e45]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0f70a7f400318b4fa]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0db9d7fef1d452a9f]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0bb63a2f82ac5687b]
module.rds.aws_security_group.example: Refreshing state... [id=sg-06bdc7be2c94a7cf0]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-0a3c585bbf6bba58b]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0d00944d99dfe3fb9]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-071a11b51c485b0b1]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-02c271aaae088ea4b]
module.rds.aws_security_group.vpc_endpoint_rds: Refreshing state... [id=sg-0ce678efdd64b44e5]
module.rds.aws_security_group.ec2_private: Refreshing state... [id=sg-086f3ab5fea1aa2b9]
module.rds.aws_security_group.ec2_private_nat_to_global: Refreshing state... [id=sg-0d5ed516513b6a83c]
module.rds.aws_security_group.ec2_public_bastian: Refreshing state... [id=sg-0ca95d51ffe6d8894]
module.rds.aws_security_group.mysql_to_private: Refreshing state... [id=sg-0200472868087adb3]
module.ecr-app.aws_security_group.vpc_endpoint: Refreshing state... [id=sg-096192166d6f9cd8b]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-071dd337cfbbbb50d]
module.ecr-app.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05f06bcd8be5135ea]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/85c2e8b8911549f7]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0829c8222f3c2e3f0]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0833e5cbb3feed7c41080289494]
module.rds.aws_security_group_rule.in_ssh: Refreshing state... [id=sgrule-1848129182]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e859eb1301e09d1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfdb12fab7d4006a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f51279304586a58e]
module.rds.aws_security_group_rule.out_all: Refreshing state... [id=sgrule-3986439656]
module.rds.aws_security_group_rule.in_icmp: Refreshing state... [id=sgrule-4046640019]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-0840d58339cd83f90]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0a74d87da37cd4c32]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c7b9baba708642b6]
module.ecr-app.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0aa2aa645cd78c54a]
module.ecr-app.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-060745b09df69e96a]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/2d23d36ec59ecb9b]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[0]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea3530383921]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[1]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea46037175]
module.ecr-app.aws_vpc_endpoint_route_table_association.private_s3[2]: Refreshing state... [id=a-vpce-05f06bcd8be5135ea2941716146]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/cb9619fbb54169cb]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261/d135b6a132b7b048]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-line-bot-sample2-20210429021106029600000001]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=line-bot-sample2-task-definition]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      ~ id       = "84e53bf240898fa099cb0a7c8515ca5987c001a87e29de4ac8a356b7cfb9d723" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - image        = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-app:0.0.1-5191cf8"
                  - name         = "line-bot-sample2-app"
                  - portMappings = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                  + environment  = [
                      + {
                          + name  = "MYSQL_DATABASE"
                          + value = "${mysql_database}"
                        },
                      + {
                          + name  = "MYSQL_USER"
                          + value = "${mysql_user}"
                        },
                    ]
                  + secrets      = [
                      + {
                          + name      = "MYSQL_PASSWORD"
                          + valueFrom = "${database_password}"
                        },
                    ]
                    # (3 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          + "database_password"    = (known after apply)
          + "mysql_database"       = "linebotsample2database"
          + "mysql_user"           = "user"
            # (3 unchanged elements hidden)
        }
    }

  # module.ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2"
        name                               = "line-bot-sample2"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:8" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/line-bot-sample2-task-definition:8" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 0
                  - environment  = []
                  - essential    = true
                  - image        = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-app:0.0.1-5191cf8"
                  - mountPoints  = []
                  - name         = "line-bot-sample2-app"
                  - portMappings = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom  = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "line-bot-sample2-task-definition" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "linebot-sample2-rds-mysql"
      + id          = (known after apply)
      + name        = "linebot-sample2-rds-mysql"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-02c271aaae088ea4b",
          + "subnet-071a11b51c485b0b1",
          + "subnet-0d00944d99dfe3fb9",
        ]
      + tags_all    = (known after apply)
    }

  # module.rds.aws_iam_role_policy.mysql_db_password_policy_secretsmanager will be created
  + resource "aws_iam_role_policy" "mysql_db_password_policy_secretsmanager" {
      + id     = (known after apply)
      + name   = "password-policy-mysql_db_password_policy_secretsmanager"
      + policy = (known after apply)
      + role   = "EcsTaskRole-line-bot-sample2"
    }

  # module.rds.aws_rds_cluster.this will be created
  + resource "aws_rds_cluster" "this" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "linebot-sample2-rds-mysql"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "linebotsample2database"
      + db_cluster_parameter_group_name = "linebot-sample2-rds-mysql"
      + db_subnet_group_name            = "linebot-sample2-rds-mysql"
      + enable_http_endpoint            = false
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_mode                     = "provisioned"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "user"
      + port                            = 3306
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_security_group_ids          = (known after apply)
    }

  # module.rds.aws_rds_cluster_instance.this will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "linebot-sample2-rds-mysql"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.small"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 0
      + monitoring_role_arn             = (known after apply)
      + performance_insights_enabled    = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags_all                        = (known after apply)
      + writer                          = (known after apply)
    }

  # module.rds.aws_rds_cluster_parameter_group.this will be created
  + resource "aws_rds_cluster_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "linebot-sample2-rds-mysql"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_connection"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_database"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_results"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Tokyo"
        }
    }

  # module.rds.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "linebot-sample2-rds-mysql"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "linebot-sample2-rds-mysql"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "linebot-sample2-rds-mysql"
        }
      + tags_all               = {
          + "Name" = "linebot-sample2-rds-mysql"
        }
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.rds.aws_security_group_rule.mysql will be created
  + resource "aws_security_group_rule" "mysql" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds.aws_ssm_parameter.database_password_secret will be created
  + resource "aws_ssm_parameter" "database_password_secret" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "MYSQL_PASSWORD"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.rds.aws_vpc_endpoint.rds will be created
  + resource "aws_vpc_endpoint" "rds" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0ce678efdd64b44e5",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.rds"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-02c271aaae088ea4b",
          + "subnet-071a11b51c485b0b1",
          + "subnet-0d00944d99dfe3fb9",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

Plan: 10 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*